{"news":[{"title":"General","date":"March19,2020","description":"Aeternum is a land of immense beauty and endless wonder that The Corrupted seek to stain and dominate with their vile presence. Taking what was once serene and peaceful and twisting it to their will.  Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/kn0Q97uU22IeIvGHPP1uL/fc9ec09cf5332578543aa282d12c867e/FTW_0080_v003_Final_thumbnail.jpg"},{"title":"General","date":"April9,2020","description":"Aeternum is a mysterious and hostile land where you will fight to get a foothold and must be ready to defend it from invading forces... human and supernatural. In New World, when the forces of Corruption have amassed enough strength in a Territory, they lay siege to the Fort. This is called an Invasion.  Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/7yqpWALx70fAMAKMUxTjOr/9afbb1daede8762fdc10d1292b387a27/Trailer-4k-Shot-_3_thumbnail.jpg"},{"title":"General","date":"April30,2020","description":"Aeternum is a place of struggle. Not only will you have to contend with the forces of Corruption, but you must also protect yourself from other players.  Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/4vbK8iETiYeddj44VWbfBT/56c3c16204b001b5dbc4df0fa092f2e8/War_thumbnail.jpg"},{"title":"General","date":"May14,2020","description":"On your adventures and trials in Aeternum, you’ll stumble upon mysterious and timeworn structures. Clearly constructs of the Ancients, the true purpose of these Arenas has been lost to time. Through unknown magic and ritual, the Ancients were able to bend the laws of Aeternum and bind some of its most powerful denizens within these structures.  Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/oyAqEzS0UWEb8Ld2psSZN/8b106dc37c5c494a7f52f11c1c64513f/thumbnail.jpg"},{"title":"General","date":"June3,2020","description":"Throughout your adventure in Aeternum, you will get your hands on a wide variety of items. You will collect consumables such as food, drinks, potions, weapon coatings and tinctures as well as armor and weapons.  Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/QxCt1xYhDrKLT20tnlG10/6b4cef049bd293848b4e837abe218fc0/thumbnail.jpg"},{"title":"General","date":"June9,2020","description":"To survive and thrive in New World you will need to overcome many challenges, learning new skills and abilities as you adventure forward. Characters progress across three major categories: Core Attributes, Trade Skills, and Weapon Mastery.     Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/1Q1vjC3Z4pDG5jV9SS1sMf/6cd8b6f17668d5e15948c45ccb1827bd/thumbnail.jpg"},{"title":"General","date":"June10,2020","description":"When you arrive at Aeternum, you will immediately face challenges to overcome. You will assess your surrounding, find resources to harvest and gather, and begin crafting tools to ensure your survival. Trading and crafting skills in New World are powerful tools and progress endlessly.     Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/3UsKgjB4bm41WXufwRJm8N/a1921142d26e26c9b6b2eada87344e77/thumbnail.jpg"},{"title":"Devdiaries","date":"July10,2020","description":"We want our players to feel completely immersed in the game, and know that our studio stands for quality and lasting gameplay you can trust — and that means added time to get things where we want them before we fully release.  Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/4aiPgnMp3CrvZ39oQqQnHE/34aed6174b535f280ff21de1d0140d85/Shattered-Obelisk-thumb.jpg"},{"title":"General","date":"March13,2020","description":"We’ve been live with our latest Alpha for over a month now and it feels like the right time to send a letter to the community. We’ve learned a lot and we wanted to take a moment to update you on the state of New World’s Alpha and give you some insight to our future plans.   Read more","imageUrl":"//images.ctfassets.net/j95d1p8hsuun/7KfNtS4cx3z5YtQesCsO0Z/f834cc3b5f58054bc288feb266fd9ceb/FTW_0025_v007_Final.jpg"}]}